In [1]:
!pip install ipython-sql

%load_ext sql

Requirement already satisfied: ipython-sql in c:\users\user\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (8.27.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: executing in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
# %sql mysql://root:your_password@localhost/your_database
%sql mysql://root:Mother%40123@localhost/customer_analysis

In [3]:
!pip install prettytable==0.7.2

Requirement already satisfied: prettytable==0.7.2 in c:\users\user\anaconda3\lib\site-packages (0.7.2)

In [4]:
%sql SHOW TABLES FROM customer_analysis;

 * mysql://root:***@localhost/customer_analysis
3 rows affected.

[('gold.dim_customers',), ('gold.dim_products',), ('gold.fact_sales',)]

## Change Over Time Analysis

In [5]:
%sql SELECT * FROM `gold.dim_customers` LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 11000, 'AW00011000', 'Jon', 'Yang', 'Australia', 'Married', 'Male', '1971-10-06', '2025-10-06'),
 (2, 11001, 'AW00011001', 'Eugene', 'Huang', 'Australia', 'Single', 'Male', '1976-05-10', '2025-10-06'),
 (3, 11002, 'AW00011002', 'Ruben', 'Torres', 'Australia', 'Married', 'Male', '1971-02-09', '2025-10-06'),
 (4, 11003, 'AW00011003', 'Christy', 'Zhu', 'Australia', 'Single', 'Female', '1973-08-14', '2025-10-06'),
 (5, 11004, 'AW00011004', 'Elizabeth', 'Johnson', 'Australia', 'Single', 'Female', '1979-08-05', '2025-10-06')]

In [6]:
%sql SELECT * FROM `gold.dim_products` LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 210, 'FR-R92B-58', 'HL Road Frame - Black- 58', 'CO_RF', 'Components', 'Road Frames', 'Yes', 0, 'Road', '2003-07-01'),
 (2, 211, 'FR-R92R-58', 'HL Road Frame - Red- 58', 'CO_RF', 'Components', 'Road Frames', 'Yes', 0, 'Road', '2003-07-01'),
 (3, 348, 'BK-M82B-38', 'Mountain-100 Black- 38', 'BI_MB', 'Bikes', 'Mountain Bikes', 'Yes', 1898, 'Mountain', '2011-07-01'),
 (4, 349, 'BK-M82B-42', 'Mountain-100 Black- 42', 'BI_MB', 'Bikes', 'Mountain Bikes', 'Yes', 1898, 'Mountain', '2011-07-01'),
 (5, 350, 'BK-M82B-44', 'Mountain-100 Black- 44', 'BI_MB', 'Bikes', 'Mountain Bikes', 'Yes', 1898, 'Mountain', '2011-07-01')]

In [7]:
%sql SELECT * FROM `gold.fact_sales` LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[('SO54496', 282, 5400, '2013-03-16', '2013-03-23', '2013-03-28', 25, 1, 25),
 ('SO54496', 289, 5400, '2013-03-16', '2013-03-23', '2013-03-28', 5, 1, 5),
 ('SO54496', 259, 5400, '2013-03-16', '2013-03-23', '2013-03-28', 2, 1, 2),
 ('SO54497', 174, 9281, '2013-03-16', '2013-03-23', '2013-03-28', 22, 1, 22),
 ('SO54497', 280, 9281, '2013-03-16', '2013-03-23', '2013-03-28', 9, 1, 9)]

## Analyze Sales performance over time

In [8]:
%%sql 
SELECT 
YEAR(order_date) as year, 
MONTH(order_date) as month, 
SUM(sales_amount) as total_amount, 
COUNT(DISTINCT customer_key) as total_customer,
SUM(quantity) as total_quantity
FROM `gold.fact_sales` 
WHERE YEAR(order_date) IS NOT NULL 
GROUP BY YEAR(order_date), MONTH(order_date)
ORDER BY YEAR(order_date), MONTH(order_date)
LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(2010, 12, Decimal('43419'), 14, Decimal('14')),
 (2011, 1, Decimal('469795'), 144, Decimal('144')),
 (2011, 2, Decimal('466307'), 144, Decimal('144')),
 (2011, 3, Decimal('485165'), 150, Decimal('150')),
 (2011, 4, Decimal('502042'), 157, Decimal('157'))]

## Cumulative Analysis
Aggregating the data progressively over time. To help us understand the growth or decline in business over time

In [9]:
%%sql
SELECT
year,
total_sales,
SUM(total_sales) OVER (ORDER BY year) AS running_total_sales
FROM
(
SELECT 
YEAR(order_date) AS year, 
SUM(sales_amount) AS total_sales
FROM `gold.fact_sales`
WHERE YEAR(order_date) IS NOT NULL 
GROUP BY YEAR(order_date)
) t

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(2010, Decimal('43419'), Decimal('43419')),
 (2011, Decimal('7075088'), Decimal('7118507')),
 (2012, Decimal('5842231'), Decimal('12960738')),
 (2013, Decimal('16344878'), Decimal('29305616')),
 (2014, Decimal('45642'), Decimal('29351258'))]

In [10]:
%%sql
SELECT
    year,
    total_sales,
    SUM(total_sales) OVER (ORDER BY year) AS running_total_sales,
    AVG(avg_price) OVER (ORDER BY year) AS moving_average_price
FROM (
    SELECT 
        YEAR(order_date) AS year, 
        SUM(sales_amount) AS total_sales,
        AVG(price) AS avg_price
    FROM `gold.fact_sales`
    WHERE YEAR(order_date) IS NOT NULL 
    GROUP BY YEAR(order_date)
) t

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(2010, Decimal('43419'), Decimal('43419'), Decimal('3101.35710000')),
 (2011, Decimal('7075088'), Decimal('7118507'), Decimal('3147.04315000')),
 (2012, Decimal('5842231'), Decimal('12960738'), Decimal('2671.30233333')),
 (2013, Decimal('16344878'), Decimal('29305616'), Decimal('2080.89110000')),
 (2014, Decimal('45642'), Decimal('29351258'), Decimal('1669.34658000'))]

## PERFORMANCE ANALYSIS
comparing current value to a target value

--- Analyse the yearly performance of products by comparing each product's sales to both its average sales performance and the previous year's sales performance

%%sql

SELECT
YEAR(f.order_date) AS year,
p.product_name,
SUM(f.sales_amount) AS current_sales
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_products` p
ON f.product_key = p.product_key
WHERE YEAR(f.order_date) IS NOT NULL
GROUP BY YEAR(f.order_date),
p.product_name
LIMIT 10

## comparing the current sales with the Average sales

In [11]:
%%sql

WITH yearly_product_sales AS
(
SELECT
YEAR(f.order_date) AS year,
p.product_name,
SUM(f.sales_amount) AS current_sales
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_products` p
ON f.product_key = p.product_key
WHERE YEAR(f.order_date) IS NOT NULL
GROUP BY YEAR(f.order_date),
p.product_name
)
SELECT
year,
product_name,
current_sales,
AVG(current_sales) OVER (PARTITION BY product_name) AS avg_sales,
current_sales - AVG(current_sales) OVER (PARTITION BY product_name) AS diff_avg,
CASE WHEN current_sales - AVG(current_sales) OVER (PARTITION BY product_name) > 0 THEN 'Above Avg'
    WHEN current_sales - AVG(current_sales) OVER (PARTITION BY product_name) < 0 THEN 'Below Avg'
    ELSE 'Avg'
END avg_change
FROM yearly_product_sales
ORDER BY product_name, year
LIMIT 20;

 * mysql://root:***@localhost/customer_analysis
20 rows affected.

[(2012, 'All-Purpose Bike Stand', Decimal('159'), Decimal('13197.0000'), Decimal('-13038.0000'), 'Below Avg'),
 (2013, 'All-Purpose Bike Stand', Decimal('37683'), Decimal('13197.0000'), Decimal('24486.0000'), 'Above Avg'),
 (2014, 'All-Purpose Bike Stand', Decimal('1749'), Decimal('13197.0000'), Decimal('-11448.0000'), 'Below Avg'),
 (2012, 'AWC Logo Cap', Decimal('72'), Decimal('6570.0000'), Decimal('-6498.0000'), 'Below Avg'),
 (2013, 'AWC Logo Cap', Decimal('18891'), Decimal('6570.0000'), Decimal('12321.0000'), 'Above Avg'),
 (2014, 'AWC Logo Cap', Decimal('747'), Decimal('6570.0000'), Decimal('-5823.0000'), 'Below Avg'),
 (2013, 'Bike Wash - Dissolver', Decimal('6960'), Decimal('3636.0000'), Decimal('3324.0000'), 'Above Avg'),
 (2014, 'Bike Wash - Dissolver', Decimal('312'), Decimal('3636.0000'), Decimal('-3324.0000'), 'Below Avg'),
 (2013, 'Classic Vest- L', Decimal('11968'), Decimal('6240.0000'), Decimal('5728.0000'), 'Above Avg'),
 (2014, 'Classic Vest- L', Decimal('512'), Decimal('6240.0000'), Decimal('-5728.0000'), 'Below Avg'),
 (2013, 'Classic Vest- M', Decimal('11840'), Decimal('6368.0000'), Decimal('5472.0000'), 'Above Avg'),
 (2014, 'Classic Vest- M', Decimal('896'), Decimal('6368.0000'), Decimal('-5472.0000'), 'Below Avg'),
 (2012, 'Classic Vest- S', Decimal('64'), Decimal('3648.0000'), Decimal('-3584.0000'), 'Below Avg'),
 (2013, 'Classic Vest- S', Decimal('10368'), Decimal('3648.0000'), Decimal('6720.0000'), 'Above Avg'),
 (2014, 'Classic Vest- S', Decimal('512'), Decimal('3648.0000'), Decimal('-3136.0000'), 'Below Avg'),
 (2012, 'Fender Set - Mountain', Decimal('110'), Decimal('15554.0000'), Decimal('-15444.0000'), 'Below Avg'),
 (2013, 'Fender Set - Mountain', Decimal('44484'), Decimal('15554.0000'), Decimal('28930.0000'), 'Above Avg'),
 (2014, 'Fender Set - Mountain', Decimal('2068'), Decimal('15554.0000'), Decimal('-13486.0000'), 'Below Avg'),
 (2012, 'Half-Finger Gloves- L', Decimal('24'), Decimal('3544.0000'), Decimal('-3520.0000'), 'Below Avg'),
 (2013, 'Half-Finger Gloves- L', Decimal('10248'), Decimal('3544.0000'), Decimal('6704.0000'), 'Above Avg')]

## comparing the current sales with the previous year

In [12]:
%%sql

WITH yearly_product_sales AS
(
SELECT
YEAR(f.order_date) AS year,
p.product_name,
SUM(f.sales_amount) AS current_sales
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_products` p
ON f.product_key = p.product_key
WHERE YEAR(f.order_date) IS NOT NULL
GROUP BY YEAR(f.order_date),
p.product_name
)
SELECT
year,
product_name,
current_sales,
LAG(current_sales) OVER (PARTITION BY product_name ORDER BY year) AS preyear_sales,
current_sales - LAG(current_sales) OVER (PARTITION BY product_name ORDER BY year) AS diff_preyear_sales,
CASE WHEN current_sales - LAG(current_sales) OVER (PARTITION BY product_name ORDER BY year) > 0 THEN 'Increasing'
    WHEN current_sales - LAG(current_sales) OVER (PARTITION BY product_name ORDER BY year) < 0 THEN 'Decreasing'
    ELSE 'No Change'
END preyear_change
FROM yearly_product_sales
ORDER BY product_name, year
LIMIT 20;

 * mysql://root:***@localhost/customer_analysis
20 rows affected.

[(2012, 'All-Purpose Bike Stand', Decimal('159'), None, None, 'No Change'),
 (2013, 'All-Purpose Bike Stand', Decimal('37683'), Decimal('159'), Decimal('37524'), 'Increasing'),
 (2014, 'All-Purpose Bike Stand', Decimal('1749'), Decimal('37683'), Decimal('-35934'), 'Decreasing'),
 (2012, 'AWC Logo Cap', Decimal('72'), None, None, 'No Change'),
 (2013, 'AWC Logo Cap', Decimal('18891'), Decimal('72'), Decimal('18819'), 'Increasing'),
 (2014, 'AWC Logo Cap', Decimal('747'), Decimal('18891'), Decimal('-18144'), 'Decreasing'),
 (2013, 'Bike Wash - Dissolver', Decimal('6960'), None, None, 'No Change'),
 (2014, 'Bike Wash - Dissolver', Decimal('312'), Decimal('6960'), Decimal('-6648'), 'Decreasing'),
 (2013, 'Classic Vest- L', Decimal('11968'), None, None, 'No Change'),
 (2014, 'Classic Vest- L', Decimal('512'), Decimal('11968'), Decimal('-11456'), 'Decreasing'),
 (2013, 'Classic Vest- M', Decimal('11840'), None, None, 'No Change'),
 (2014, 'Classic Vest- M', Decimal('896'), Decimal('11840'), Decimal('-10944'), 'Decreasing'),
 (2012, 'Classic Vest- S', Decimal('64'), None, None, 'No Change'),
 (2013, 'Classic Vest- S', Decimal('10368'), Decimal('64'), Decimal('10304'), 'Increasing'),
 (2014, 'Classic Vest- S', Decimal('512'), Decimal('10368'), Decimal('-9856'), 'Decreasing'),
 (2012, 'Fender Set - Mountain', Decimal('110'), None, None, 'No Change'),
 (2013, 'Fender Set - Mountain', Decimal('44484'), Decimal('110'), Decimal('44374'), 'Increasing'),
 (2014, 'Fender Set - Mountain', Decimal('2068'), Decimal('44484'), Decimal('-42416'), 'Decreasing'),
 (2012, 'Half-Finger Gloves- L', Decimal('24'), None, None, 'No Change'),
 (2013, 'Half-Finger Gloves- L', Decimal('10248'), Decimal('24'), Decimal('10224'), 'Increasing')]

## PART TO WHOLE ANALYSIS
This analysis analyzes how an individual part is performing compared ro the overall, allowing us to understand which category has the greatest impact on this business

--- Which category cotribute the most to the over all sales?

In [13]:
%%sql
WITH category_sales AS
(
SELECT 
category,
SUM(sales_amount) AS total_sales
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_products` p
ON p.product_key = f.product_key
GROUP BY category )

SELECT 
category,
total_sales,
SUM(total_sales) OVER() overall_sales,
CONCAT(ROUND(total_sales / SUM(total_sales) OVER() * 100, 2), '%') AS per_of_total
FROM category_sales
ORDER BY total_sales DESC

 * mysql://root:***@localhost/customer_analysis
3 rows affected.

[('Bikes', Decimal('28316272'), Decimal('29356250'), '96.46%'),
 ('Accessories', Decimal('700262'), Decimal('29356250'), '2.39%'),
 ('Clothing', Decimal('339716'), Decimal('29356250'), '1.16%')]

## DATA SEGMENTATION
Here we group data based on specific range. This helps us to understand the correlation between two measures

--- Segement product into cost ranges and count how many product falls into each segment

In [14]:
%%sql
WITH product_segment AS
(
SELECT
product_key,
product_name,
cost,
CASE WHEN cost < 100 THEN 'Below 100'
    WHEN cost BETWEEN 100 AND 500 THEN '100-500'
    WHEN cost BETWEEN 500 AND 1000 THEN '500-1000'
    ELSE 'Above 1000'
END cost_range
FROM `gold.dim_products` 
)
SELECT
cost_range,
COUNT(product_key) AS total_product
FROM product_segment
GROUP BY cost_range
ORDER BY total_product DESC

 * mysql://root:***@localhost/customer_analysis
4 rows affected.

[('Below 100', 110), ('100-500', 101), ('500-1000', 45), ('Above 1000', 39)]

--- Grouping customer into 3 segments based on their spending behaviour
--1 VIP. customer with at least 12 months history and spending more than 5,000
--2. Regular. Customers with at least 12 months of history and spending 5,000 or less
--3. New. Customers with less than 12 months

In [15]:
%%sql

SELECT
c.customer_key,
SUM(f.sales_amount) AS total_spending,
MIN(order_date) AS first_order,
MAX(order_date) AS last_order,
TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_customers` c
ON f.customer_key = c.customer_key
GROUP BY c.customer_key
LIMIT 10

 * mysql://root:***@localhost/customer_analysis
10 rows affected.

[(5400, Decimal('32'), '2013-03-16', '2013-03-16', 0),
 (4825, Decimal('76'), '2013-03-16', '2013-03-16', 0),
 (4286, Decimal('40'), '2013-03-16', '2013-03-16', 0),
 (1472, Decimal('84'), '2013-03-16', '2013-03-16', 0),
 (2777, Decimal('71'), '2013-03-08', '2013-03-16', 0),
 (5302, Decimal('73'), '2013-03-16', '2013-03-16', 0),
 (582, Decimal('237'), '2013-02-11', '2013-11-22', 9),
 (3822, Decimal('30'), '2013-03-16', '2013-03-16', 0),
 (13, Decimal('81'), '2013-03-16', '2013-10-15', 6),
 (732, Decimal('121'), '2013-03-16', '2013-08-04', 4)]

In [16]:
%%sql

WITH customer_spending AS
(
SELECT
c.customer_key,
SUM(f.sales_amount) AS total_spending,
MIN(order_date) AS first_order,
MAX(order_date) AS last_order,
TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_customers` c
ON f.customer_key = c.customer_key
GROUP BY c.customer_key
)

SELECT
customer_key,
total_spending,
lifespan,
CASE WHEN lifespan >= 12 AND total_spending > 5000 THEN 'VIP'
    WHEN lifespan >= 12 AND total_spending <= 5000 THEN 'Regular'
    ELSE 'New'
END customer_segment
FROM customer_spending
LIMIT 20

 * mysql://root:***@localhost/customer_analysis
20 rows affected.

[(5400, Decimal('32'), 0, 'New'),
 (4825, Decimal('76'), 0, 'New'),
 (4286, Decimal('40'), 0, 'New'),
 (1472, Decimal('84'), 0, 'New'),
 (2777, Decimal('71'), 0, 'New'),
 (5302, Decimal('73'), 0, 'New'),
 (582, Decimal('237'), 9, 'New'),
 (3822, Decimal('30'), 0, 'New'),
 (13, Decimal('81'), 6, 'New'),
 (732, Decimal('121'), 4, 'New'),
 (3354, Decimal('129'), 0, 'New'),
 (348, Decimal('14'), 0, 'New'),
 (5897, Decimal('1715'), 0, 'New'),
 (3084, Decimal('2751'), 12, 'Regular'),
 (3104, Decimal('3611'), 13, 'Regular'),
 (98, Decimal('8099'), 27, 'VIP'),
 (1631, Decimal('6825'), 8, 'New'),
 (51, Decimal('5007'), 32, 'VIP'),
 (1134, Decimal('5830'), 21, 'VIP'),
 (3100, Decimal('200'), 5, 'New')]

## Total number of customer for each categories

In [17]:
%%sql

WITH customer_spending AS
(
SELECT
c.customer_key,
SUM(f.sales_amount) AS total_spending,
MIN(order_date) AS first_order,
MAX(order_date) AS last_order,
TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_customers` c
ON f.customer_key = c.customer_key
GROUP BY c.customer_key
)

SELECT
customer_segment,
COUNT(customer_key) AS total_customers
FROM(
SELECT
customer_key,
CASE WHEN lifespan >= 12 AND total_spending > 5000 THEN 'VIP'
    WHEN lifespan >= 12 AND total_spending <= 5000 THEN 'Regular'
    ELSE 'New'
END customer_segment
FROM customer_spending) t
GROUP BY customer_segment
ORDER BY total_customers DESC

 * mysql://root:***@localhost/customer_analysis
3 rows affected.

[('New', 14830), ('Regular', 2037), ('VIP', 1617)]


## CUSTOMER REPORT

# Purpose:

This report Consolidate key customer metrics and behaviour

# Highlight:
-- Gather essential fields such as names, ages, and transaction details

-- Segment customer into categories (VIP, Regular and New) and age groups

-- Aggregate Customer level metrics:

            -- Total order
            -- Total Sales
            -- Total product
            -- Total quantity purchased
            -- LifeSpan (in Month)
            
-- Calculate Valuable KPIs:

            -- Recency 
            -- Average order value
            -- Average monthly spent

## BASE QUERY
retrieve core column from the tables

In [18]:
%%sql

WITH base_query AS
(
SELECT
f.order_number,
f.product_key,
f.order_date,
f.sales_amount,
f.quantity,
c.customer_key,
c.customer_number,
CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
TIMESTAMPDIFF(year, c.birthdate, CURDATE()) age
FROM `gold.fact_sales` f
LEFT JOIN `gold.dim_customers` c
ON f.customer_key = c.customer_key
WHERE order_date IS NOT NULL)
SELECT
customer_key,
customer_number,
customer_name,
age,
COUNT(DISTINCT order_number) AS total_order,
SUM(sales_amount) AS total_sales,
SUM(quantity) AS total_quantity,
COUNT(DISTINCT product_key) AS total_product,
MAX(order_date) AS last_order,
TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
FROM base_query
GROUP BY customer_key,
customer_number,
customer_name,
age
LIMIT 5

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 'AW00011000', 'Jon Yang', 53, 3, Decimal('8249'), Decimal('8'), 8, '2013-05-03', 27),
 (2, 'AW00011001', 'Eugene Huang', 48, 3, Decimal('6384'), Decimal('11'), 10, '2013-12-10', 34),
 (3, 'AW00011002', 'Ruben Torres', 54, 3, Decimal('8114'), Decimal('4'), 4, '2013-02-23', 25),
 (4, 'AW00011003', 'Christy Zhu', 51, 3, Decimal('8139'), Decimal('9'), 9, '2013-05-10', 28),
 (5, 'AW00011004', 'Elizabeth Johnson', 45, 3, Decimal('8196'), Decimal('6'), 6, '2013-05-01', 27)]

The above result is the aggregation of customer-level metrics:
(Total order, Total Sales, Total product, Total quantity purchased,- LifeSpan (in Month))

## Segmenting customers into groups based on life span and spending behaviour

In [19]:
%%sql

WITH base_query AS (
  SELECT 
    f.order_number, 
    f.product_key, 
    f.order_date, 
    f.sales_amount, 
    f.quantity, 
    c.customer_key, 
    c.customer_number, 
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    TIMESTAMPDIFF(YEAR, c.birthdate, CURDATE()) AS age
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_customers` c ON f.customer_key = c.customer_key
  WHERE 
    order_date IS NOT NULL
),
customer_aggregation AS (
  SELECT 
    customer_key, 
    customer_number, 
    customer_name, 
    age, 
    COUNT(DISTINCT order_number) AS total_order, 
    SUM(sales_amount) AS total_sales, 
    SUM(quantity) AS total_quantity, 
    COUNT(DISTINCT product_key) AS total_product, 
    MAX(order_date) AS last_order,
    TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
  FROM 
    base_query
  GROUP BY 
    customer_key, 
    customer_number, 
    customer_name, 
    age
)
SELECT 
  customer_key, 
  customer_number, 
  customer_name, 
  age, 
  CASE 
    WHEN age < 20 THEN 'below 20'
    WHEN age BETWEEN 20 AND 29 THEN '20-29'
    WHEN age BETWEEN 30 AND 39 THEN '30-39'
    WHEN age BETWEEN 40 AND 49 THEN '40-49'
    ELSE '50 and above'
  END AS age_group,
  CASE 
    WHEN lifespan >= 12 AND total_sales > 5000 THEN 'VIP'
    WHEN lifespan >= 12 AND total_sales <= 5000 THEN 'Regular'
    ELSE 'New'
  END AS customer_segment,
  total_order, 
  total_sales, 
  total_quantity, 
  total_product, 
  last_order, 
  lifespan
FROM 
  customer_aggregation
LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 'AW00011000', 'Jon Yang', 53, '50 and above', 'VIP', 3, Decimal('8249'), Decimal('8'), 8, '2013-05-03', 27),
 (2, 'AW00011001', 'Eugene Huang', 48, '40-49', 'VIP', 3, Decimal('6384'), Decimal('11'), 10, '2013-12-10', 34),
 (3, 'AW00011002', 'Ruben Torres', 54, '50 and above', 'VIP', 3, Decimal('8114'), Decimal('4'), 4, '2013-02-23', 25),
 (4, 'AW00011003', 'Christy Zhu', 51, '50 and above', 'VIP', 3, Decimal('8139'), Decimal('9'), 9, '2013-05-10', 28),
 (5, 'AW00011004', 'Elizabeth Johnson', 45, '40-49', 'VIP', 3, Decimal('8196'), Decimal('6'), 6, '2013-05-01', 27)]

## Calculating Valuable KPI

In [26]:
%%sql

WITH base_query AS (
  SELECT 
    f.order_number, 
    f.product_key, 
    f.order_date, 
    f.sales_amount, 
    f.quantity, 
    c.customer_key, 
    c.customer_number, 
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    TIMESTAMPDIFF(YEAR, c.birthdate, CURDATE()) AS age
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_customers` c ON f.customer_key = c.customer_key
  WHERE 
    order_date IS NOT NULL
),
customer_aggregation AS (
  SELECT 
    customer_key, 
    customer_number, 
    customer_name, 
    age, 
    COUNT(DISTINCT order_number) AS total_order, 
    SUM(sales_amount) AS total_sales, 
    SUM(quantity) AS total_quantity, 
    COUNT(DISTINCT product_key) AS total_product, 
    MAX(order_date) AS last_order_date,
    TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
  FROM 
    base_query
  GROUP BY 
    customer_key, 
    customer_number, 
    customer_name, 
    age
)
SELECT 
  customer_key, 
  customer_number, 
  customer_name, 
  age, 
  CASE 
    WHEN age < 20 THEN 'below 20'
    WHEN age BETWEEN 20 AND 29 THEN '20-29'
    WHEN age BETWEEN 30 AND 39 THEN '30-39'
    WHEN age BETWEEN 40 AND 49 THEN '40-49'
    ELSE '50 and above'
  END AS age_group,
  CASE 
    WHEN lifespan >= 12 AND total_sales > 5000 THEN 'VIP'
    WHEN lifespan >= 12 AND total_sales <= 5000 THEN 'Regular'
    ELSE 'New'
  END AS customer_segment,
  last_order_date, 
  TIMESTAMPDIFF(MONTH, last_order_date, CURDATE()) AS recency,
  total_order, 
  total_sales, 
  total_quantity, 
  total_product, 
  lifespan,

  #computing average order Value
  CASE WHEN total_order = 0 THEN 0
      ELSE total_sales / total_order
  END avg_order_value,

  #computing average monthly spent
  CASE WHEN lifespan = 0 THEN total_sales
      ELSE total_sales / lifespan
  END avg_monthly_spent

FROM 
  customer_aggregation
LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 'AW00011000', 'Jon Yang', 53, '50 and above', 'VIP', '2013-05-03', 142, 3, Decimal('8249'), Decimal('8'), 8, 27, Decimal('2749.6667'), Decimal('305.5185')),
 (2, 'AW00011001', 'Eugene Huang', 48, '40-49', 'VIP', '2013-12-10', 135, 3, Decimal('6384'), Decimal('11'), 10, 34, Decimal('2128.0000'), Decimal('187.7647')),
 (3, 'AW00011002', 'Ruben Torres', 54, '50 and above', 'VIP', '2013-02-23', 144, 3, Decimal('8114'), Decimal('4'), 4, 25, Decimal('2704.6667'), Decimal('324.5600')),
 (4, 'AW00011003', 'Christy Zhu', 51, '50 and above', 'VIP', '2013-05-10', 142, 3, Decimal('8139'), Decimal('9'), 9, 28, Decimal('2713.0000'), Decimal('290.6786')),
 (5, 'AW00011004', 'Elizabeth Johnson', 45, '40-49', 'VIP', '2013-05-01', 142, 3, Decimal('8196'), Decimal('6'), 6, 27, Decimal('2732.0000'), Decimal('303.5556'))]

Now that we have a full report of the customers based on the requirement, we will take the whole query and put it in the database as a view. Once we have the view report in the database, we can create a dashboard in order to visualize the data using Tableau or power BI 

## Put the query in the database as (gold_report_customer)

In [31]:
%%sql

CREATE VIEW gold_report_customers AS
WITH base_query AS (
  SELECT 
    f.order_number, 
    f.product_key, 
    f.order_date, 
    f.sales_amount, 
    f.quantity, 
    c.customer_key, 
    c.customer_number, 
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    TIMESTAMPDIFF(YEAR, c.birthdate, CURDATE()) AS age
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_customers` c ON f.customer_key = c.customer_key
  WHERE 
    order_date IS NOT NULL
),
customer_aggregation AS (
  SELECT 
    customer_key, 
    customer_number, 
    customer_name, 
    age, 
    COUNT(DISTINCT order_number) AS total_order, 
    SUM(sales_amount) AS total_sales, 
    SUM(quantity) AS total_quantity, 
    COUNT(DISTINCT product_key) AS total_product, 
    MAX(order_date) AS last_order_date,
    TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan
  FROM 
    base_query
  GROUP BY 
    customer_key, 
    customer_number, 
    customer_name, 
    age
)
SELECT 
  customer_key, 
  customer_number, 
  customer_name, 
  age, 
  CASE 
    WHEN age < 20 THEN 'below 20'
    WHEN age BETWEEN 20 AND 29 THEN '20-29'
    WHEN age BETWEEN 30 AND 39 THEN '30-39'
    WHEN age BETWEEN 40 AND 49 THEN '40-49'
    ELSE '50 and above'
  END AS age_group,
  CASE 
    WHEN lifespan >= 12 AND total_sales > 5000 THEN 'VIP'
    WHEN lifespan >= 12 AND total_sales <= 5000 THEN 'Regular'
    ELSE 'New'
  END AS customer_segment,
  last_order_date, 
  TIMESTAMPDIFF(MONTH, last_order_date, CURDATE()) AS recency,
  total_order, 
  total_sales, 
  total_quantity, 
  total_product, 
  lifespan,

  #computing average order Value
  CASE WHEN total_order = 0 THEN 0
      ELSE total_sales / total_order
  END avg_order_value,

  #computing average monthly spent
  CASE WHEN lifespan = 0 THEN total_sales
      ELSE total_sales / lifespan
  END avg_monthly_spent

FROM 
  customer_aggregation;

 * mysql://root:***@localhost/customer_analysis
0 rows affected.

[]

In [32]:
%%sql

SELECT * FROM gold_report_customers
LIMIT 5

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(1, 'AW00011000', 'Jon Yang', 53, '50 and above', 'VIP', '2013-05-03', 142, 3, Decimal('8249'), Decimal('8'), 8, 27, Decimal('2749.6667'), Decimal('305.5185')),
 (2, 'AW00011001', 'Eugene Huang', 48, '40-49', 'VIP', '2013-12-10', 135, 3, Decimal('6384'), Decimal('11'), 10, 34, Decimal('2128.0000'), Decimal('187.7647')),
 (3, 'AW00011002', 'Ruben Torres', 54, '50 and above', 'VIP', '2013-02-23', 144, 3, Decimal('8114'), Decimal('4'), 4, 25, Decimal('2704.6667'), Decimal('324.5600')),
 (4, 'AW00011003', 'Christy Zhu', 51, '50 and above', 'VIP', '2013-05-10', 142, 3, Decimal('8139'), Decimal('9'), 9, 28, Decimal('2713.0000'), Decimal('290.6786')),
 (5, 'AW00011004', 'Elizabeth Johnson', 45, '40-49', 'VIP', '2013-05-01', 142, 3, Decimal('8196'), Decimal('6'), 6, 27, Decimal('2732.0000'), Decimal('303.5556'))]

## PRODUCT REPORT

Purpose:

--- This report consolidate key product metrics and behaviours 

Highlight:

--- gather essential fields such as product name, category, subcategory and cost

---  Segment product by revenue to identify hig performers, Mid range, or low performers

---  Aggregate produc level Metrics
   -- total order
   -- total sales,
   -- total quantity sold
   -- total customers (unique)
   -- lifespan (in months)

---  Calculate valuable KPIs: recency ( month since last sold) average order revenue and average monthly revenue.

## BASE QUERY
retrieve core columns from table

In [36]:
%%sql

WITH base_query AS (
  SELECT 
    f.order_number, 
    f.order_date, 
    f.customer_key, 
    f.sales_amount, 
    f.quantity, 
    p.product_key, 
    p.product_name, 
    p.category, 
    p.subcategory, 
    p.cost
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_products` p ON f.product_key = p.product_key
  WHERE 
    order_date IS NOT NULL
)
SELECT 
  product_key, 
  product_name, 
  category, 
  subcategory, 
  cost,
  TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan,
  MAX(order_date) AS last_order_date,
  COUNT(DISTINCT order_number) AS total_order,
  COUNT(DISTINCT customer_key) AS total_customer,
  SUM(sales_amount) AS total_sales,
  SUM(quantity) AS total_quantity,
  COALESCE(ROUND(AVG(CAST(sales_amount AS FLOAT) / NULLIF(quantity, 0)), 1), 0) AS avg_selling_price
FROM 
  base_query
GROUP BY 
  product_key, 
  product_name, 
  category, 
  subcategory, 
  cost
ORDER BY 
  total_sales DESC
LIMIT 5;

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(122, 'Mountain-200 Black- 46', 'Bikes', 'Mountain Bikes', 1252, 23, '2013-12-27', 620, 600, Decimal('1373454'), Decimal('620'), 2215.2),
 (121, 'Mountain-200 Black- 42', 'Bikes', 'Mountain Bikes', 1252, 23, '2013-12-28', 614, 604, Decimal('1363128'), Decimal('614'), 2220.1),
 (123, 'Mountain-200 Silver- 38', 'Bikes', 'Mountain Bikes', 1266, 23, '2013-12-28', 596, 583, Decimal('1339394'), Decimal('596'), 2247.3),
 (125, 'Mountain-200 Silver- 46', 'Bikes', 'Mountain Bikes', 1266, None, '2013-12-28', 580, 567, Decimal('1301029'), Decimal('580'), 2243.2),
 (120, 'Mountain-200 Black- 38', 'Bikes', 'Mountain Bikes', 1252, None, '2013-12-28', 582, 565, Decimal('1294854'), Decimal('582'), 2224.8)]

In [42]:
%%sql

WITH base_query AS (
  SELECT 
    f.order_number, 
    f.order_date, 
    f.customer_key, 
    f.sales_amount, 
    f.quantity, 
    p.product_key, 
    p.product_name, 
    p.category, 
    p.subcategory, 
    p.cost
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_products` p ON f.product_key = p.product_key
  WHERE 
    order_date IS NOT NULL
),
product_aggregation AS (
  SELECT 
    product_key, 
    product_name, 
    category, 
    subcategory, 
    cost,
    TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan,
    MAX(order_date) AS last_order_date,
    COUNT(DISTINCT order_number) AS total_order,
    COUNT(DISTINCT customer_key) AS total_customer,
    SUM(sales_amount) AS total_sales,
    SUM(quantity) AS total_quantity,
    COALESCE(ROUND(AVG(CAST(sales_amount AS FLOAT) / NULLIF(quantity, 0)), 1), 0) AS avg_selling_price
  FROM 
    base_query
  GROUP BY 
    product_key, 
    product_name, 
    category, 
    subcategory, 
    cost
)
SELECT 
  product_key, 
  product_name, 
  category, 
  subcategory, 
  cost,
  TIMESTAMPDIFF(MONTH, last_order_date, CURDATE()) AS recency_in_months,
  CASE 
    WHEN total_sales > 50000 THEN 'High-Performer'
    WHEN total_sales >= 10000 THEN 'Mid-Performer'
    ELSE 'Low-Performer'
  END AS product_segment,
  lifespan,
  total_order,
  total_sales,
  total_quantity,
  total_customer,
  avg_selling_price,
  CASE 
    WHEN total_order = 0 THEN 0
    ELSE total_sales / total_order
  END AS avg_order_revenue,
  CASE 
    WHEN lifespan = 0 THEN total_sales
    ELSE total_sales / lifespan
  END AS avg_monthly_revenue
FROM 
  product_aggregation
LIMIT 5

 * mysql://root:***@localhost/customer_analysis
5 rows affected.

[(3, 'Mountain-100 Black- 38', 'Bikes', 'Mountain Bikes', 1898, 158, 'High-Performer', 11, 49, Decimal('165375'), Decimal('49'), 49, 3375.0, Decimal('3375.0000'), Decimal('15034.0909')),
 (4, 'Mountain-100 Black- 42', 'Bikes', 'Mountain Bikes', 1898, 158, 'High-Performer', 11, 45, Decimal('151875'), Decimal('45'), 45, 3375.0, Decimal('3375.0000'), Decimal('13806.8182')),
 (5, 'Mountain-100 Black- 44', 'Bikes', 'Mountain Bikes', 1898, 158, 'High-Performer', 11, 60, Decimal('202500'), Decimal('60'), 60, 3375.0, Decimal('3375.0000'), Decimal('18409.0909')),
 (6, 'Mountain-100 Black- 48', 'Bikes', 'Mountain Bikes', 1898, 158, 'High-Performer', 11, 57, Decimal('192375'), Decimal('57'), 57, 3375.0, Decimal('3375.0000'), Decimal('17488.6364')),
 (7, 'Mountain-100 Silver- 38', 'Bikes', 'Mountain Bikes', 1912, 158, 'High-Performer', 11, 58, Decimal('197200'), Decimal('58'), 58, 3400.0, Decimal('3400.0000'), Decimal('17927.2727'))]

## Put the query in the database (as gold_report_product)

In [47]:
%%sql

CREATE VIEW gold_report_product AS
WITH base_query AS (
  SELECT 
    f.order_number, 
    f.order_date, 
    f.customer_key, 
    f.sales_amount, 
    f.quantity, 
    p.product_key, 
    p.product_name, 
    p.category, 
    p.subcategory, 
    p.cost
  FROM 
    `gold.fact_sales` f
  LEFT JOIN 
    `gold.dim_products` p ON f.product_key = p.product_key
  WHERE 
    order_date IS NOT NULL
),
product_aggregation AS (
  SELECT 
    product_key, 
    product_name, 
    category, 
    subcategory, 
    cost,
    TIMESTAMPDIFF(MONTH, MIN(order_date), MAX(order_date)) AS lifespan,
    MAX(order_date) AS last_order_date,
    COUNT(DISTINCT order_number) AS total_order,
    COUNT(DISTINCT customer_key) AS total_customer,
    SUM(sales_amount) AS total_sales,
    SUM(quantity) AS total_quantity,
    COALESCE(ROUND(AVG(CAST(sales_amount AS FLOAT) / NULLIF(quantity, 0)), 1), 0) AS avg_selling_price
  FROM 
    base_query
  GROUP BY 
    product_key, 
    product_name, 
    category, 
    subcategory, 
    cost
)
SELECT 
  product_key, 
  product_name, 
  category, 
  subcategory, 
  cost,
  TIMESTAMPDIFF(MONTH, last_order_date, CURDATE()) AS recency_in_months,
  CASE 
    WHEN total_sales > 50000 THEN 'High-Performer'
    WHEN total_sales >= 10000 THEN 'Mid-Performer'
    ELSE 'Low-Performer'
  END AS product_segment,
  lifespan,
  total_order,
  total_sales,
  total_quantity,
  total_customer,
  avg_selling_price,
  CASE 
    WHEN total_order = 0 THEN 0
    ELSE total_sales / total_order
  END AS avg_order_revenue,
  CASE 
    WHEN lifespan = 0 THEN total_sales
    ELSE total_sales / lifespan
  END AS avg_monthly_revenue
FROM 
  product_aggregation

 * mysql://root:***@localhost/customer_analysis
0 rows affected.

[]